
** Brands
  #+begin_src bash :results output
    curl -XGET -H "Content-type: application/json" 'http://localhost:3000/brands'
  #+end_src

  #+RESULTS:

  #+begin_src bash :results output
    curl -XPOST -H "Content-type: application/json" 'http://localhost:3000/brands' \
    -d '{
      "name": "abc"
    }'
  #+end_src

  #+RESULTS:
  : {"id":3,"name":"abc","ean_prefix":null,"created_at":"2023-02-09T00:49:56.005Z","updated_at":"2023-02-09T00:49:56.005Z"}

** Purchases
  #+begin_src bash :results output
    curl -XGET -H "Content-type: application/json" 'http://localhost:3000/purchases'
  #+end_src

  #+RESULTS:
  : [{"id":1,"event_datetime":"2023-02-08T00:00:00.000Z","location":"Carrefour Osasco","comment":"","created_at":"2023-02-08T21:23:14.161Z","updated_at":"2023-02-08T21:23:14.161Z"},{"id":2,"event_datetime":"2023-02-09T12:00:00.000Z","location":"Carrefour Supershopping","comment":"abc","created_at":"2023-02-08T21:23:58.074Z","updated_at":"2023-02-08T21:23:58.074Z"}]

  #+begin_src bash :results output
    curl -XPOST -H "Content-type: application/json" 'http://localhost:3000/purchases' \
    -d '{
      "event_datetime": "2023-02-09T12:00:00",
      "location": "Carrefour Supershopping",
      "comment": "abc"
    }'
  #+end_src

  #+RESULTS:
  : {"id":2,"event_datetime":"2023-02-09T12:00:00.000Z","location":"Carrefour Supershopping","comment":"abc","created_at":"2023-02-08T21:23:58.074Z","updated_at":"2023-02-08T21:23:58.074Z"}

** Products
  #+begin_src bash :results output
    curl -XGET -H "Content-type: application/json" 'http://localhost:3000/products'
  #+end_src

  #+RESULTS:
  : [{"id":1,"name":"Galaxy A52","brand_id":1,"gtin":"710010003","photo_url":null,"created_at":"2023-01-08T00:00:00.000Z","updated_at":"2023-01-08T00:00:00.000Z"}]

  #+begin_src bash :results output
    curl -XPOST -H "Content-type: application/json" 'http://localhost:3000/products' \
    -d '{
      "name": "Iphone XR",
      "gtin": "71002233",
      "brand_id": "2",
    }'
  #+end_src

  #+RESULTS:
  : {"status":400,"error":"Bad Request","exception":"#\u003cActionDispatch::Http::Parameters::ParseError: Error occurred while parsing request parameters\u003e","traces":{"Application Trace":[{"exception_object_id":18720,"id":8,"trace":"app/controllers/products_controller.rb:49:in `product_params'"},{"exception_object_id":18720,"id":9,"trace":"app/controllers/products_controller.rb:18:in `create'"}],"Framework Trace":[{"exception_object_id":18720,"id":0,"trace":"actionpack (7.0.4.2) lib/action_dispatch/http/parameters.rb:96:in `rescue in parse_formatted_parameters'"},{"exception_object_id":18720,"id":1,"trace":"actionpack (7.0.4.2) lib/action_dispatch/http/parameters.rb:92:in `parse_formatted_parameters'"},{"exception_object_id":18720,"id":2,"trace":"actionpack (7.0.4.2) lib/action_dispatch/http/request.rb:390:in `block in POST'"},{"exception_object_id":18720,"id":3,"trace":"rack (2.2.6.2) lib/rack/request.rb:69:in `fetch'"},{"exception_object_id":18720,"id":4,"trace":"rack (2.2.6.2) lib/rack/request.rb:69:in `fetch_header'"},{"exception_object_id":18720,"id":5,"trace":"actionpack (7.0.4.2) lib/action_dispatch/http/request.rb:389:in `POST'"},{"exception_object_id":18720,"id":6,"trace":"actionpack (7.0.4.2) lib/action_dispatch/http/parameters.rb:55:in `parameters'"},{"exception_object_id":18720,"id":7,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/strong_parameters.rb:1232:in `params'"},{"exception_object_id":18720,"id":10,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/basic_implicit_render.rb:6:in `send_action'"},{"exception_object_id":18720,"id":11,"trace":"actionpack (7.0.4.2) lib/abstract_controller/base.rb:215:in `process_action'"},{"exception_object_id":18720,"id":12,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/rendering.rb:53:in `process_action'"},{"exception_object_id":18720,"id":13,"trace":"actionpack (7.0.4.2) lib/abstract_controller/callbacks.rb:234:in `block in process_action'"},{"exception_object_id":18720,"id":14,"trace":"activesupport (7.0.4.2) lib/active_support/callbacks.rb:107:in `run_callbacks'"},{"exception_object_id":18720,"id":15,"trace":"actionpack (7.0.4.2) lib/abstract_controller/callbacks.rb:233:in `process_action'"},{"exception_object_id":18720,"id":16,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/rescue.rb:22:in `process_action'"},{"exception_object_id":18720,"id":17,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/instrumentation.rb:67:in `block in process_action'"},{"exception_object_id":18720,"id":18,"trace":"activesupport (7.0.4.2) lib/active_support/notifications.rb:206:in `block in instrument'"},{"exception_object_id":18720,"id":19,"trace":"activesupport (7.0.4.2) lib/active_support/notifications/instrumenter.rb:24:in `instrument'"},{"exception_object_id":18720,"id":20,"trace":"activesupport (7.0.4.2) lib/active_support/notifications.rb:206:in `instrument'"},{"exception_object_id":18720,"id":21,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/instrumentation.rb:66:in `process_action'"},{"exception_object_id":18720,"id":22,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/params_wrapper.rb:259:in `process_action'"},{"exception_object_id":18720,"id":23,"trace":"activerecord (7.0.4.2) lib/active_record/railties/controller_runtime.rb:27:in `process_action'"},{"exception_object_id":18720,"id":24,"trace":"actionpack (7.0.4.2) lib/abstract_controller/base.rb:151:in `process'"},{"exception_object_id":18720,"id":25,"trace":"actionpack (7.0.4.2) lib/action_controller/metal.rb:188:in `dispatch'"},{"exception_object_id":18720,"id":26,"trace":"actionpack (7.0.4.2) lib/action_controller/metal.rb:251:in `dispatch'"},{"exception_object_id":18720,"id":27,"trace":"actionpack (7.0.4.2) lib/action_dispatch/routing/route_set.rb:49:in `dispatch'"},{"exception_object_id":18720,"id":28,"trace":"actionpack (7.0.4.2) lib/action_dispatch/routing/route_set.rb:32:in `serve'"},{"exception_object_id":18720,"id":29,"trace":"actionpack (7.0.4.2) lib/action_dispatch/journey/router.rb:50:in `block in serve'"},{"exception_object_id":18720,"id":30,"trace":"actionpack (7.0.4.2) lib/action_dispatch/journey/router.rb:32:in `each'"},{"exception_object_id":18720,"id":31,"trace":"actionpack (7.0.4.2) lib/action_dispatch/journey/router.rb:32:in `serve'"},{"exception_object_id":18720,"id":32,"trace":"actionpack (7.0.4.2) lib/action_dispatch/routing/route_set.rb:852:in `call'"},{"exception_object_id":18720,"id":33,"trace":"rack (2.2.6.2) lib/rack/etag.rb:27:in `call'"},{"exception_object_id":18720,"id":34,"trace":"rack (2.2.6.2) lib/rack/conditional_get.rb:40:in `call'"},{"exception_object_id":18720,"id":35,"trace":"rack (2.2.6.2) lib/rack/head.rb:12:in `call'"},{"exception_object_id":18720,"id":36,"trace":"activerecord (7.0.4.2) lib/active_record/migration.rb:603:in `call'"},{"exception_object_id":18720,"id":37,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/callbacks.rb:27:in `block in call'"},{"exception_object_id":18720,"id":38,"trace":"activesupport (7.0.4.2) lib/active_support/callbacks.rb:99:in `run_callbacks'"},{"exception_object_id":18720,"id":39,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/callbacks.rb:26:in `call'"},{"exception_object_id":18720,"id":40,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/executor.rb:14:in `call'"},{"exception_object_id":18720,"id":41,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/actionable_exceptions.rb:17:in `call'"},{"exception_object_id":18720,"id":42,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/debug_exceptions.rb:28:in `call'"},{"exception_object_id":18720,"id":43,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/show_exceptions.rb:26:in `call'"},{"exception_object_id":18720,"id":44,"trace":"railties (7.0.4.2) lib/rails/rack/logger.rb:40:in `call_app'"},{"exception_object_id":18720,"id":45,"trace":"railties (7.0.4.2) lib/rails/rack/logger.rb:25:in `block in call'"},{"exception_object_id":18720,"id":46,"trace":"activesupport (7.0.4.2) lib/active_support/tagged_logging.rb:99:in `block in tagged'"},{"exception_object_id":18720,"id":47,"trace":"activesupport (7.0.4.2) lib/active_support/tagged_logging.rb:37:in `tagged'"},{"exception_object_id":18720,"id":48,"trace":"activesupport (7.0.4.2) lib/active_support/tagged_logging.rb:99:in `tagged'"},{"exception_object_id":18720,"id":49,"trace":"railties (7.0.4.2) lib/rails/rack/logger.rb:25:in `call'"},{"exception_object_id":18720,"id":50,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/remote_ip.rb:93:in `call'"},{"exception_object_id":18720,"id":51,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/request_id.rb:26:in `call'"},{"exception_object_id":18720,"id":52,"trace":"rack (2.2.6.2) lib/rack/runtime.rb:22:in `call'"},{"exception_object_id":18720,"id":53,"trace":"activesupport (7.0.4.2) lib/active_support/cache/strategy/local_cache_middleware.rb:29:in `call'"},{"exception_object_id":18720,"id":54,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/server_timing.rb:61:in `block in call'"},{"exception_object_id":18720,"id":55,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/server_timing.rb:26:in `collect_events'"},{"exception_object_id":18720,"id":56,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/server_timing.rb:60:in `call'"},{"exception_object_id":18720,"id":57,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/executor.rb:14:in `call'"},{"exception_object_id":18720,"id":58,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/static.rb:23:in `call'"},{"exception_object_id":18720,"id":59,"trace":"rack (2.2.6.2) lib/rack/sendfile.rb:110:in `call'"},{"exception_object_id":18720,"id":60,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/host_authorization.rb:137:in `call'"},{"exception_object_id":18720,"id":61,"trace":"rack-cors (1.1.1) lib/rack/cors.rb:100:in `call'"},{"exception_object_id":18720,"id":62,"trace":"railties (7.0.4.2) lib/rails/engine.rb:530:in `call'"},{"exception_object_id":18720,"id":63,"trace":"puma (5.6.5) lib/puma/configuration.rb:252:in `call'"},{"exception_object_id":18720,"id":64,"trace":"puma (5.6.5) lib/puma/request.rb:77:in `block in handle_request'"},{"exception_object_id":18720,"id":65,"trace":"puma (5.6.5) lib/puma/thread_pool.rb:340:in `with_force_shutdown'"},{"exception_object_id":18720,"id":66,"trace":"puma (5.6.5) lib/puma/request.rb:76:in `handle_request'"},{"exception_object_id":18720,"id":67,"trace":"puma (5.6.5) lib/puma/server.rb:443:in `process_client'"},{"exception_object_id":18720,"id":68,"trace":"puma (5.6.5) lib/puma/thread_pool.rb:147:in `block in spawn_thread'"}],"Full Trace":[{"exception_object_id":18720,"id":0,"trace":"actionpack (7.0.4.2) lib/action_dispatch/http/parameters.rb:96:in `rescue in parse_formatted_parameters'"},{"exception_object_id":18720,"id":1,"trace":"actionpack (7.0.4.2) lib/action_dispatch/http/parameters.rb:92:in `parse_formatted_parameters'"},{"exception_object_id":18720,"id":2,"trace":"actionpack (7.0.4.2) lib/action_dispatch/http/request.rb:390:in `block in POST'"},{"exception_object_id":18720,"id":3,"trace":"rack (2.2.6.2) lib/rack/request.rb:69:in `fetch'"},{"exception_object_id":18720,"id":4,"trace":"rack (2.2.6.2) lib/rack/request.rb:69:in `fetch_header'"},{"exception_object_id":18720,"id":5,"trace":"actionpack (7.0.4.2) lib/action_dispatch/http/request.rb:389:in `POST'"},{"exception_object_id":18720,"id":6,"trace":"actionpack (7.0.4.2) lib/action_dispatch/http/parameters.rb:55:in `parameters'"},{"exception_object_id":18720,"id":7,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/strong_parameters.rb:1232:in `params'"},{"exception_object_id":18720,"id":8,"trace":"app/controllers/products_controller.rb:49:in `product_params'"},{"exception_object_id":18720,"id":9,"trace":"app/controllers/products_controller.rb:18:in `create'"},{"exception_object_id":18720,"id":10,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/basic_implicit_render.rb:6:in `send_action'"},{"exception_object_id":18720,"id":11,"trace":"actionpack (7.0.4.2) lib/abstract_controller/base.rb:215:in `process_action'"},{"exception_object_id":18720,"id":12,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/rendering.rb:53:in `process_action'"},{"exception_object_id":18720,"id":13,"trace":"actionpack (7.0.4.2) lib/abstract_controller/callbacks.rb:234:in `block in process_action'"},{"exception_object_id":18720,"id":14,"trace":"activesupport (7.0.4.2) lib/active_support/callbacks.rb:107:in `run_callbacks'"},{"exception_object_id":18720,"id":15,"trace":"actionpack (7.0.4.2) lib/abstract_controller/callbacks.rb:233:in `process_action'"},{"exception_object_id":18720,"id":16,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/rescue.rb:22:in `process_action'"},{"exception_object_id":18720,"id":17,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/instrumentation.rb:67:in `block in process_action'"},{"exception_object_id":18720,"id":18,"trace":"activesupport (7.0.4.2) lib/active_support/notifications.rb:206:in `block in instrument'"},{"exception_object_id":18720,"id":19,"trace":"activesupport (7.0.4.2) lib/active_support/notifications/instrumenter.rb:24:in `instrument'"},{"exception_object_id":18720,"id":20,"trace":"activesupport (7.0.4.2) lib/active_support/notifications.rb:206:in `instrument'"},{"exception_object_id":18720,"id":21,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/instrumentation.rb:66:in `process_action'"},{"exception_object_id":18720,"id":22,"trace":"actionpack (7.0.4.2) lib/action_controller/metal/params_wrapper.rb:259:in `process_action'"},{"exception_object_id":18720,"id":23,"trace":"activerecord (7.0.4.2) lib/active_record/railties/controller_runtime.rb:27:in `process_action'"},{"exception_object_id":18720,"id":24,"trace":"actionpack (7.0.4.2) lib/abstract_controller/base.rb:151:in `process'"},{"exception_object_id":18720,"id":25,"trace":"actionpack (7.0.4.2) lib/action_controller/metal.rb:188:in `dispatch'"},{"exception_object_id":18720,"id":26,"trace":"actionpack (7.0.4.2) lib/action_controller/metal.rb:251:in `dispatch'"},{"exception_object_id":18720,"id":27,"trace":"actionpack (7.0.4.2) lib/action_dispatch/routing/route_set.rb:49:in `dispatch'"},{"exception_object_id":18720,"id":28,"trace":"actionpack (7.0.4.2) lib/action_dispatch/routing/route_set.rb:32:in `serve'"},{"exception_object_id":18720,"id":29,"trace":"actionpack (7.0.4.2) lib/action_dispatch/journey/router.rb:50:in `block in serve'"},{"exception_object_id":18720,"id":30,"trace":"actionpack (7.0.4.2) lib/action_dispatch/journey/router.rb:32:in `each'"},{"exception_object_id":18720,"id":31,"trace":"actionpack (7.0.4.2) lib/action_dispatch/journey/router.rb:32:in `serve'"},{"exception_object_id":18720,"id":32,"trace":"actionpack (7.0.4.2) lib/action_dispatch/routing/route_set.rb:852:in `call'"},{"exception_object_id":18720,"id":33,"trace":"rack (2.2.6.2) lib/rack/etag.rb:27:in `call'"},{"exception_object_id":18720,"id":34,"trace":"rack (2.2.6.2) lib/rack/conditional_get.rb:40:in `call'"},{"exception_object_id":18720,"id":35,"trace":"rack (2.2.6.2) lib/rack/head.rb:12:in `call'"},{"exception_object_id":18720,"id":36,"trace":"activerecord (7.0.4.2) lib/active_record/migration.rb:603:in `call'"},{"exception_object_id":18720,"id":37,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/callbacks.rb:27:in `block in call'"},{"exception_object_id":18720,"id":38,"trace":"activesupport (7.0.4.2) lib/active_support/callbacks.rb:99:in `run_callbacks'"},{"exception_object_id":18720,"id":39,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/callbacks.rb:26:in `call'"},{"exception_object_id":18720,"id":40,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/executor.rb:14:in `call'"},{"exception_object_id":18720,"id":41,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/actionable_exceptions.rb:17:in `call'"},{"exception_object_id":18720,"id":42,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/debug_exceptions.rb:28:in `call'"},{"exception_object_id":18720,"id":43,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/show_exceptions.rb:26:in `call'"},{"exception_object_id":18720,"id":44,"trace":"railties (7.0.4.2) lib/rails/rack/logger.rb:40:in `call_app'"},{"exception_object_id":18720,"id":45,"trace":"railties (7.0.4.2) lib/rails/rack/logger.rb:25:in `block in call'"},{"exception_object_id":18720,"id":46,"trace":"activesupport (7.0.4.2) lib/active_support/tagged_logging.rb:99:in `block in tagged'"},{"exception_object_id":18720,"id":47,"trace":"activesupport (7.0.4.2) lib/active_support/tagged_logging.rb:37:in `tagged'"},{"exception_object_id":18720,"id":48,"trace":"activesupport (7.0.4.2) lib/active_support/tagged_logging.rb:99:in `tagged'"},{"exception_object_id":18720,"id":49,"trace":"railties (7.0.4.2) lib/rails/rack/logger.rb:25:in `call'"},{"exception_object_id":18720,"id":50,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/remote_ip.rb:93:in `call'"},{"exception_object_id":18720,"id":51,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/request_id.rb:26:in `call'"},{"exception_object_id":18720,"id":52,"trace":"rack (2.2.6.2) lib/rack/runtime.rb:22:in `call'"},{"exception_object_id":18720,"id":53,"trace":"activesupport (7.0.4.2) lib/active_support/cache/strategy/local_cache_middleware.rb:29:in `call'"},{"exception_object_id":18720,"id":54,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/server_timing.rb:61:in `block in call'"},{"exception_object_id":18720,"id":55,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/server_timing.rb:26:in `collect_events'"},{"exception_object_id":18720,"id":56,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/server_timing.rb:60:in `call'"},{"exception_object_id":18720,"id":57,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/executor.rb:14:in `call'"},{"exception_object_id":18720,"id":58,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/static.rb:23:in `call'"},{"exception_object_id":18720,"id":59,"trace":"rack (2.2.6.2) lib/rack/sendfile.rb:110:in `call'"},{"exception_object_id":18720,"id":60,"trace":"actionpack (7.0.4.2) lib/action_dispatch/middleware/host_authorization.rb:137:in `call'"},{"exception_object_id":18720,"id":61,"trace":"rack-cors (1.1.1) lib/rack/cors.rb:100:in `call'"},{"exception_object_id":18720,"id":62,"trace":"railties (7.0.4.2) lib/rails/engine.rb:530:in `call'"},{"exception_object_id":18720,"id":63,"trace":"puma (5.6.5) lib/puma/configuration.rb:252:in `call'"},{"exception_object_id":18720,"id":64,"trace":"puma (5.6.5) lib/puma/request.rb:77:in `block in handle_request'"},{"exception_object_id":18720,"id":65,"trace":"puma (5.6.5) lib/puma/thread_pool.rb:340:in `with_force_shutdown'"},{"exception_object_id":18720,"id":66,"trace":"puma (5.6.5) lib/puma/request.rb:76:in `handle_request'"},{"exception_object_id":18720,"id":67,"trace":"puma (5.6.5) lib/puma/server.rb:443:in `process_client'"},{"exception_object_id":18720,"id":68,"trace":"puma (5.6.5) lib/puma/thread_pool.rb:147:in `block in spawn_thread'"}]}}
